#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda.data.external.archive_prepare[0]: Reading...
module.lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda.data.aws_caller_identity.current: Reading...
module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda.data.aws_region.current: Reading...
module.lambda.data.aws_partition.current: Reading...
module.lambda.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=575302032415]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pillow-lambda"
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "API linked to Lambda"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "pillow-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["GET /"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["GET /"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # module.lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/pillow-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "pillow-lambda-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pillow-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pillow-lambda"
    }

  # module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "builds/e28881ce72767011d7d752b71d878a36185fef96b461606d393a18b91d7926b1.zip"
      + function_name                  = "pillow-lambda"
      + handler                        = "app.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pillow-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = "APIGatewayAny"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pillow-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "APIGatewayAny"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.10",
                      + "./src/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./src/",
                      + null,
                    ],
                ]
              + filename      = "builds/e28881ce72767011d7d752b71d878a36185fef96b461606d393a18b91d7926b1.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e28881ce72767011d7d752b71d878a36185fef96b461606d393a18b91d7926b1.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/e28881ce72767011d7d752b71d878a36185fef96b461606d393a18b91d7926b1.zip"
          + "timestamp" = "1700479858161410000"
        }
    }

  # module.lambda.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/e28881ce72767011d7d752b71d878a36185fef96b461606d393a18b91d7926b1.zip"
          + "original_source_code" = "\"./src/\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_invoke_url = (known after apply)
  + lambda_function_name   = "pillow-lambda"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @bnusunny, Action: `pull_request`, Working Directory: ``, Workflow: `Demo4 PR Workflow`*